// 🎮 დავალება 1: სახელის ანალიზი
// მომხმარებელს შეყავს თავისი username სახელი.
// ამოცანა:
// 1.	prompt-ით შეიყვანე სახელი
// 2.	alert-ით აჩვენე:
// o	რამდენი სიმბოლოა სახელში (length)
// o	სახელი დიდი ასოებით (toUpperCase())
// 📌 მაგ:
// Username: scriptolog
// Length: 10

// let username = prompt("Enter your name:");
// alert(username);
//--------------------------------------

// 🧙 დავალება 2: Magic word
// online თამაშში არსებობს საიდუმლო სიტყვა: "magic"
// ამოცანა:
// 1.	მოთამაშემ უნდა შეიყვანოს სიტყვა ან სიტყვები
// 2.	შეამოწმე:
// o	შეიცავს თუ არა შეყვანილი ტექსტი "magic"  - (includes()გამოიყენე)
// 🎯 თუ შეიცავს დაწერე →
// "✨ ძალა გააქტიურდა!"

// ❌ თუ არა →
// "ცდა ჩაიშალა 😢"

